#### Import արեք pandas գրադարանը pd  անունով

In [1]:
 import pandas as pd

### Import the dataset baby_names.txt, assign it to a variable called baby_names

### Import արեք baby_names.txt dataset-ը ու այն վերագրեք baby_names փոփոխականի

In [9]:
baby_names = pd.read_csv('baby_names.csv')

### See the first 10 entries.

### Տպեք առաջին 10 արժեքը

In [10]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Delete the columns 'Unnamed: 0' and 'Id'

### Ջնջեք 'Unnamed: 0' ու 'Id' սյուները

In [11]:
baby_names.drop(columns=['Unnamed: 0', 'Id'],inplace=True)
baby_names

         Name  Year Gender State  Count
0        Emma  2004      F    AK     62
1     Madison  2004      F    AK     48
2      Hannah  2004      F    AK     46
3       Grace  2004      F    AK     44
4       Emily  2004      F    AK     41
...       ...   ...    ...   ...    ...
2498    Devin  2004      M    AK     12
2499     Liam  2004      M    AK     12
2500     Paul  2004      M    AK     12
2501  Richard  2004      M    AK     12
2502  Trenton  2004      M    AK     12

[2503 rows x 5 columns]

### Are there more male or female names in the dataset?

### Արդյոք dataset-ում ավելի շատ են կանացի թե տղամարդու անունները?

In [17]:
baby_names['Gender'].value_counts()

F    2404
M      99
Name: Gender, dtype: int64

### Delete the column 'Year'. Group the dataset by name and assign to names.

### Ջնջեք 'Year' սյունը. Խմբավորեք dataset-ը ըստ անունի ու վերագրեք արդյունքը names փոփոխականին

In [13]:
baby_names.drop(columns=['Year'],inplace=True)

In [38]:
names = baby_names.groupby(['Name'], as_index =False)['Count'].sum()

### How many different names exist in the dataset?

### Քանի հատ տարբեր անուն կա dataset-ում?

In [45]:
names               ## 575

        Name  Count
0    Aaliyah    117
1      Aaron     29
2       Abby     12
3    Abigail    392
4        Ada      5
..       ...    ...
570    Wyatt     20
571   Xander     13
572  Zachary     27
573      Zoe    159
574     Zoey    154

[575 rows x 2 columns]

In [ ]:
# TODO

### What is the name with most occurrences?

### Որն է ամենաշատ հանդիպող անունը?

In [33]:
names.sort_values(by = 'Count', ascending =False).reset_index(drop=True, inplace=True)   ## EMMA

### What is the median name occurrence?

### Որն է անունների հանդիպման մեդիանը՞

In [49]:
names['Count'].median()

24.0

### Get a summary with the mean, min, max, std and quartiles.

### Ստացեք dataset-ի ամփոփում mean, min, max, std ու quartile-ներով

In [50]:
names.describe()

            Count
count  575.000000
mean    49.994783
std     69.852894
min      5.000000
25%     11.000000
50%     24.000000
75%     60.000000
max    561.000000